In [1]:
import pandas

In [3]:
import pandas as pd
obj= pd.Series([14, 2, -2, 3])
obj

0    14
1     2
2    -2
3     3
dtype: int64

In [4]:
obj2 = pd.Series([4, 7, -5, 3], index=['f ', 'g', 'h', 'i'])
#Series 的values和index属性获取其数组表示形式和索引对
obj2

f     4
g     7
h    -5
i     3
dtype: int64

In [5]:
obj2 = pd.Series([4, 7, -5, 3], index=[3，4，5，6])
#Series 的values和index属性获取其数组表示形式和索引对
obj2

SyntaxError: invalid character in identifier (<ipython-input-5-683dfc02069b>, line 1)

In [9]:
obj2['f']
#可以通过索引的方式选取Series中的单个或一组值

KeyError: 'f'

In [11]:
obj2['i']

3

In [12]:
'f' in obj2

False

In [13]:
'g' in obj2

True

In [22]:
sdata = {'a': 35, 'b': 78, 'c': 13,
'd': 50}
obj3 = pd.Series(sdata)
obj3

a    35
b    78
c    13
d    50
dtype: int64

In [23]:
obj3.isnull()

a    False
b    False
c    False
d    False
dtype: bool

In [29]:
data = {'name':['coco','lucky','Gucci'],'year': [20, 20, 20],'like': ['yellow', 'red', 'blue']}
frame = pd.DataFrame(data)
frame
#建DataFrame的办法有很多，最常用的一种是直接传入一个由等长列表或NumPy数组组成的字

    name  year    like
0   coco    20  yellow
1  lucky    20     red
2  Gucci    20    blue

In [49]:
data = {'name':['coco','lucky','Gucci'],'year': [20, 20, 20],'like': ['yellow', 'red', 'blue']}
frame2 = pd.DataFrame(data, columns=['name', 'year', 'like'],index = ['one', 'two', 'three'])
frame2

        name  year    like
one     coco    20  yellow
two    lucky    20     red
three  Gucci    20    blue

In [51]:
data = {'name':['coco','lucky','Gucci'],'year': [20, 20, 20],'like': ['yellow', 'red', 'blue']}
frame2 = pd.DataFrame(data, columns=['name', 'year', 'like','like2'],index = ['one', 'two', 'three'])
frame2
#如果传入的列在数据中找不到，就会在结果中产生缺失值

        name  year    like like2
one     coco    20  yellow   NaN
two    lucky    20     red   NaN
three  Gucci    20    blue   NaN

In [52]:
frame2.columns

Index(['name', 'year', 'like', 'like2'], dtype='object')

In [53]:
frame2['like']

one      yellow
two         red
three      blue
Name: like, dtype: object

In [54]:
frame2['like2'] = 1000

In [55]:
frame2

        name  year    like  like2
one     coco    20  yellow   1000
two    lucky    20     red   1000
three  Gucci    20    blue   1000

In [57]:
frame2['like2'] = 'dakdmaksmda'
frame2

        name  year    like        like2
one     coco    20  yellow  dakdmaksmda
two    lucky    20     red  dakdmaksmda
three  Gucci    20    blue  dakdmaksmda

In [58]:
del frame2['year']
frame2

        name    like        like2
one     coco  yellow  dakdmaksmda
two    lucky     red  dakdmaksmda
three  Gucci    blue  dakdmaksmda

In [59]:
frame3 = pd.DataFrame(frame2)
frame3

        name    like        like2
one     coco  yellow  dakdmaksmda
two    lucky     red  dakdmaksmda
three  Gucci    blue  dakdmaksmda

In [60]:
index = frame3.index
index

Index(['one', 'two', 'three'], dtype='object')

In [61]:
index[1] = 'd' 
#Index对象是不可变的，因此用户不能对其进行修改：

TypeError: Index does not support mutable operations

In [63]:
frame3=frame3.reindex(['a', 'b', 'c'])
frame3

  name like like2
a  NaN  NaN   NaN
b  NaN  NaN   NaN
c  NaN  NaN   NaN

In [67]:
import numpy as np
obj = pd.Series(np.arange(4.), index=['x ', 'y', 'z', 'l'])
obj

x     0.0
y     1.0
z     2.0
l     3.0
dtype: float64

##### obj[['x', 'y', 'l']]

In [81]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),columns=list('abcde'))
df2.loc[1, 'b'] = np.nan
df1
df2
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [87]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [88]:
arr = np.arange(32.).reshape((8, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.],
       [12., 13., 14., 15.],
       [16., 17., 18., 19.],
       [20., 21., 22., 23.],
       [24., 25., 26., 27.],
       [28., 29., 30., 31.]])

In [91]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [92]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [93]:
frame.sort_index(axis=1, ascending=False)

   year   name    like
0    20   coco  yellow
1    20  lucky     red
2    20  Gucci    blue

In [94]:
obj = pd.Series([3, 17, -2, 1])

In [95]:
obj

0     3
1    17
2    -2
3     1
dtype: int64

In [96]:
frame = pd.DataFrame({'b': [13, 17, 213, 2], 'a': [110, 1, 40,
1], 'c': [-2, 2, 1, -90]})
frame

     b    a   c
0   13  110  -2
1   17    1   2
2  213   40   1
3    2    1 -90

In [97]:
frame.sum()
#调用DataFrame的sum方法将会返回一个含有列的和的Series：

b    245
a    152
c    -89
dtype: int64